--SELECT [Отделы].[Название отдела], [Front-end разработка], [Back-end разработка], [Реклама], [Тестировка], [Отдел техподдержки] FROM [Данные]
--INNER JOIN [Отделы] ON [Отделы].[Код отдела] = [Данные].[Отдел]
--PIVOT (COUNT([Производственный процесс]) FOR [Отделы].[Название отдела] IN ( [Front-end разработка], [Back-end разработка], [Реклама], [Тестировка], [Отдел техподдержки])) pvt



--SELECT [Отделы].[Название отдела], [1], [2], [3], [4], [5] FROM [Данные]
--INNER JOIN [Отделы] ON [Отделы].[Код отдела] = [Данные].[Отдел]
--PIVOT (COUNT([Производственный процесс]) FOR [Отдел] IN ( [1], [2], [3], [4], [5])) pvt
--CASE [Данные].[Производственный процесс] WHEN '1' THEN [Данные].[Производственный процесс] ELSE 0 END


SELECT [Отделы].[Название отдела],
	COUNT(CASE [Данные].[Производственный процесс] WHEN 1 THEN 1 END) AS [Front-end разработка], 
	COUNT(CASE [Данные].[Производственный процесс] WHEN 2 THEN 1 END) AS [Back-end разработка], 
	COUNT(CASE [Данные].[Производственный процесс] WHEN 3 THEN 1 END) AS [Реклама], 
	COUNT(CASE [Данные].[Производственный процесс] WHEN 4 THEN 1 END) AS [Тестировка], 
	COUNT(CASE [Данные].[Производственный процесс] WHEN 5 THEN 1 END) AS [Отдел техподдержки]
	FROM [Данные]
INNER JOIN [Отделы] ON [Отделы].[Код отдела] = [Данные].[Отдел]
GROUP BY [Отделы].[Название отдела]